{
    "architectures": [
        "HulumedQwen3ForCausalLM"
      ],
      "auto_map": {
            "AutoConfig": "configuration_hulumed_qwen3.HulumedQwen3Config",
            "AutoModelForCausalLM": "modeling_hulumed_qwen3.HulumedQwen3ForCausalLM"
        },
    "vocab_size": 151936,
    "max_position_embeddings": 262144,
    "hidden_size": 2560,
    "intermediate_size": 9728,
    "num_hidden_layers": 36,
    "num_attention_heads": 32,
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 36,
    "num_key_value_heads": 8,
    "head_dim": 128,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "rope_theta": 5000000,
    "rope_scaling": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": "bfloat16",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 151643,
    "pad_token_id": null,
    "eos_token_id": 151645,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_attn_implementation_autoset": true,
    "image_aspect_ratio": "avt",
    "image_size": -1,
    "image_token_index": 151669,
    "image_token_length": 1,
    "is_alignment": false,
    "vision_encoder_config": {
      "hidden_size": 1152,
      "intermediate_size": 4304,
      "model_type": "hulumed_vision_encoder",
      "num_attention_heads": 16,
      "num_hidden_layers": 27,
      "patch_size": 14
    },
    "mm_projector_lr": 1e-05,
    "mm_projector_type": "mlp2x_gelu",
    "mm_vision_select_feature": "patch",
    "mm_vision_select_layer": -1,
    "model_type": "hulumed_qwen3",
    "tokenizer_model_max_length": 32768,
    "tokenizer_padding_side": "right",
    "use_mm_proj": true,
    "use_token_compression": false
}